# AssemblyDifferenceMemberDifference Properties

---
The AssemblyDifferenceMemberDifference type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyDifference)
| MemberDifference|  Difference between the assembly members
| MemberId1|  Id of the member in the first assembly
| MemberId2|  Id of the member in the second assembly
Top
#### Reference
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace